app/controllers/backoffice/admins_controller.rb

SELECT "admins".* FROM "admins"
---
  def index
    @admins = Admin.all

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 3]]
---
  def destroy
    admin_email = @admin.email
    if @admin.destroy

UPDATE "admins" SET "name" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["name", "Diego"], ["updated_at", "2019-02-03 19:47:08.914722"], ["id", 6]]
---
  def update
    passwd = params[:admin][:password]
    passwd_confirmation = params[:admin][:password_confirmation]

    if passwd.blank? && passwd_confirmation.blank?
      params[:admin].delete(:password)
      params[:admin].delete(:password_confirmation)
    end

    if @admin.update(params_admin)

INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @admin = Admin.new(params_admin)
    if @admin.save

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_admin
    @admin = Admin.find(params[:id])