app/controllers/backoffice/categories_controller.rb

  def update
    if @category.update(params_category)
---
UPDATE "categories" SET "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "Esportes2"], ["updated_at", "2019-01-25 20:38:38.591055"], ["id", 1]]

  def create
    @category = Category.new(params_category)
    if @category.save
---
INSERT INTO "categories" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "novo3"], ["created_at", "2019-01-25 20:38:49.395696"], ["updated_at", "2019-01-25 20:38:49.395696"]]